gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/ble_pbs/ble_pbs.c
/* Copyright (c) 2012 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/* Attention! 
*  To maintain compliance with Nordic Semiconductor ASA’s Bluetooth profile 
*  qualification listings, this section of source code must not be modified.
*/

/**
 * File: ble_pbs.c
 * Description: BLE Pioneer Beacon Service 
 *
 * Copyright 2016 by CYNTEC Corporation.  All rights reserved.
 * First Author: Gill Wei
 */


#include "ble_pbs.h"

#include <stdlib.h>
#include <string.h>
#include "app_error.h"
#include "ble_gatts.h"
#include "nordic_common.h"
#include "ble_srv_common.h"
#include "app_util.h"
#include "button_led.h"
#include "nrf_delay.h"


//15422fe0-bce5-11e5-a837-0800200c9a66
#define PBS_UUID_BASE 										 {0x66,0x9A,0x0C,0x20,0x00,0x08,0x37,0xA8,0xE5,0x11,0xE5,0xBC,0xE0,0x2F,0x42,0x15}
#define PBS_SERVICE_SHORT_UUID 										0x2FE0
#define PBS_BEACON_SETTING_CHAR_SHORT_UUID 				0x2FE1
#define PBS_EVENT_STORAGE_CHAR_SHORT_UUID 				0x2FE2
#define PBS_DATA_REPORT_HEADER_CHAR_SHORT_UUID 		0x2FE3
#define PBS_CAL_DATA_REPORT_CHAR_SHORT_UUID 			0x2FE4
#define PBS_RAW_DATA_REPORT_CHAR_SHORT_UUID 			0x2FE5
#define PBS_THRESHOLD_SETTING_CHAR_SHORT_UUID			0X2FE6

#define PBS_BOARDING_DETECTION_REPORT_UUID {0xC8,0xAC,0x3A,0xC8,0xB4,0x89,0x84,0x83,0xD3,0x4A,0x87,0xE1,0x55,0x9F,0x81,0x3C}
#define PBS_BUTTON_DATA_REPORT_UUID 			 {0xBA,0x72,0x1C,0x1E,0x98,0x8B,0x19,0xAC,0xC7,0x45,0x4A,0x7F,0x09,0xE4,0xF1,0x15}
#define TSC_ALLDATA_LENGTH														17
#define BSC_ALLDATA_LENGTH														13
#define ESC_ALLDATA_LENGTH														 3
#define DRHC_ALLDATA_LENGTH														14
#define CDRC_ALLDATA_MIN_LENGTH												 3 // NOT USED
#define CDRC_ALLDATA_MAX_LENGTH												20
#define RDRC_ALLDATA_MIN_LENGTH												 3 // NOT USED
#define RDRC_ALLDATA_MAX_LENGTH												20
#define BDC_ALLDATA_LENGTH                             4
#define BDRC_ALLDATA_LENGTH                            4

#define PBS_DEBUG																			 1

static uint16_t                 service_handle;
//static ble_gatts_char_handles_t beacon_setting_handles;
//static ble_gatts_char_handles_t event_storage_handles;
//static ble_gatts_char_handles_t data_report_header_handles;
//static ble_gatts_char_handles_t cal_data_report_handles;
//static ble_gatts_char_handles_t raw_data_report_handles;

bool esc_notify_flag = false;
bool esc_write_flag = false;
bool start_dw_flag = false;
bool drhc_notify_flag = false;
bool cdrc_notify_flag = false;
bool rdrc_notify_flag = false;

// Encode All Characteristics' Data
static uint8_t uint16_big_encode(uint16_t value, uint8_t * p_encoded_data)
{
    p_encoded_data[1] = (uint8_t) ((value & 0x00FF) >> 0);
    p_encoded_data[0] = (uint8_t) ((value & 0xFF00) >> 8);
    return sizeof(uint16_t);
}

static void tsc_data_encode(uint8_t * p_encoded_buffer, const tsc_t * p_tsc)
{
		uint8_t len = 0;
	p_encoded_buffer[len++] = p_tsc->flag;
		len += uint16_big_encode(p_tsc->small_accident_level_x, &p_encoded_buffer[len]);
		len += uint16_big_encode(p_tsc->small_accident_level_y, &p_encoded_buffer[len]);
		len += uint16_big_encode(p_tsc->medium_accident_level, &p_encoded_buffer[len]);
		len += uint16_big_encode(p_tsc->high_accident_level, &p_encoded_buffer[len]);
		len += uint16_big_encode(p_tsc->hard_accelaration_level, &p_encoded_buffer[len]);
		len += uint16_big_encode(p_tsc->hard_braking_level, &p_encoded_buffer[len]);
		len += uint16_big_encode(p_tsc->hard_steering_level_left, &p_encoded_buffer[len]);
		len += uint16_big_encode(p_tsc->hard_steering_level_right, &p_encoded_buffer[len]);
}

static void bsc_data_encode(uint8_t * p_encoded_buffer, const bsc_t * p_bsc)
{
		uint8_t len = 0;
		APP_ERROR_CHECK_BOOL(p_bsc != NULL);
		APP_ERROR_CHECK_BOOL(p_encoded_buffer != NULL);
		p_encoded_buffer[len++] = p_bsc->flag;
	len += uint16_big_encode(p_bsc->sampling_frequency, &p_encoded_buffer[len]);
	len += uint16_big_encode(p_bsc->ambient_sensor_value, &p_encoded_buffer[len]);
	len += uint16_big_encode(p_bsc->acc_voltage, &p_encoded_buffer[len]);
	len += uint16_big_encode(p_bsc->ble_output_power, &p_encoded_buffer[len]);
		len += uint32_big_encode(p_bsc->current_utc, &p_encoded_buffer[len]);
}

static void esc_data_encode(uint8_t * p_encoded_buffer, const esc_t * p_esc)
{
		uint8_t len = 0;
		APP_ERROR_CHECK_BOOL(p_esc != NULL);
		APP_ERROR_CHECK_BOOL(p_encoded_buffer != NULL);
		p_encoded_buffer[len++] = p_esc->download_control_point;
		len += uint16_big_encode(p_esc->number_of_event, &p_encoded_buffer[len]);
}
static void drhc_data_encode(uint8_t * p_encoded_buffer, const drhc_t * p_drhc)
{
		uint8_t len = 0;
		APP_ERROR_CHECK_BOOL(p_drhc != NULL);
		APP_ERROR_CHECK_BOOL(p_encoded_buffer != NULL);
		p_encoded_buffer[len++] = p_drhc->recorded_data_interval;
		p_encoded_buffer[len++] = p_drhc->recorded_data_resolution;
		p_encoded_buffer[len++] = p_drhc->recorded_number_of_axis;
		p_encoded_buffer[len++] = p_drhc->recorded_event_id;
		p_encoded_buffer[len++] = p_drhc->recorded_event_duration;
		len += uint32_big_encode(p_drhc->recorded_utc_of_event_start, &p_encoded_buffer[len]);
		for (int i=0;i<5;i++)
			p_encoded_buffer[len++] = p_drhc->sensor_data_offset[i];
}
static void cdrc_data_encode(uint8_t * p_encoded_buffer, const cdrc_t * p_cdrc)
{
		uint8_t len = 0;
		APP_ERROR_CHECK_BOOL(p_cdrc != NULL);
		APP_ERROR_CHECK_BOOL(p_encoded_buffer != NULL);
			p_encoded_buffer[len++] = p_cdrc->data_packet_id;
		p_encoded_buffer[len++] = p_cdrc->data_packet_length;
	for (int i=0;i<CDRC_ALLDATA_MAX_LENGTH-2;i++)
		p_encoded_buffer[len++] = p_cdrc->data_payload[i];
}
static void rdrc_data_encode(uint8_t * p_encoded_buffer, const rdrc_t * p_rdrc)
{
		uint8_t len = 0;
		APP_ERROR_CHECK_BOOL(p_rdrc != NULL);
		APP_ERROR_CHECK_BOOL(p_encoded_buffer != NULL);
		p_encoded_buffer[len++] = p_rdrc->data_packet_id;
		p_encoded_buffer[len++] = p_rdrc->data_packet_length;
	for (int i=0;i<p_rdrc->data_packet_length;i++)
		p_encoded_buffer[len++] = p_rdrc->data_payload[i];
}
static void bdc_data_encode(uint8_t * p_encoded_buffer, const bdc_t * p_bdc)
{
		uint8_t len = 0;
		APP_ERROR_CHECK_BOOL(p_bdc != NULL);
		APP_ERROR_CHECK_BOOL(p_encoded_buffer != NULL);
		p_encoded_buffer[len++] = p_bdc->advertising_period;
		p_encoded_buffer[len++] = p_bdc->advertising_duration;
		len += uint16_big_encode(p_bdc->bdc_advertising_interval, &p_encoded_buffer[len]);
}
static void bdrc_data_encode(uint8_t * p_encoded_buffer, const bdrc_t * p_bdrc)
{
		uint8_t len = 0;
		APP_ERROR_CHECK_BOOL(p_bdrc != NULL);
		APP_ERROR_CHECK_BOOL(p_encoded_buffer != NULL);
		p_encoded_buffer[len++] = p_bdrc->advertising_time;
		len += uint16_big_encode(p_bdrc->bdrc_advertising_interval, &p_encoded_buffer[len]);
		p_encoded_buffer[len++] = p_bdrc->button_status;
		
