gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/ble_pbs/ble_pbs.c
}
static void bsc_data_process(const uint8_t * p_encoded_buffer, bsc_t * p_bsc)
{
	uint8_t led_confirmation = (p_encoded_buffer[0] & 0x01);
	uint8_t update_sampling_freqency = (p_encoded_buffer[0] & 0x02);
	uint8_t update_ble_power = (p_encoded_buffer[0] & 0x04);
	uint8_t update_current_utc = (p_encoded_buffer[0] & 0x08);
	printf("bsc_data:");
	for (int i=0;i< 13;i++)
		printf("%02X ",p_encoded_buffer[i]);
	printf("\r\n");
	if (led_confirmation == 0x01)
	{
		confirmation_led();
	}
	if (update_current_utc == 0x08)
	{
		uint32_t tempUTC = uint32_big_decode(p_encoded_buffer+9);
		UTC_set(tempUTC);
		p_bsc->current_utc = tempUTC;
		printf("UTC:%08X\r\n",tempUTC);
	}
	// Set BSC data to server
//	uint32_t err_code = NRF_SUCCESS;
//    ble_gatts_value_t gatts_value;
//		
//		// Initialize value struct.
//		memset(&gatts_value, 0, sizeof(gatts_value));

//		gatts_value.len     = BSC_ALLDATA_LENGTH;
//		gatts_value.offset  = 0;
//		gatts_value.p_value = p_encoded_buffer;

//		// Update database.
//		err_code = sd_ble_gatts_value_set(p_pbs->conn_handle,
//																			p_pbs->drhc_handles.value_handle,
//																			&gatts_value);
//#if PBS_DEBUG
//		printf("bsc set value err:%04X\r\n",err_code);
//#endif
	
}
//static void tsc_data_decode(uint8_t * p_decoded_buffer, const tsc_t * p_tsc)
//{
//		uint8_t len = 0;
//		p_tsc->flag = p_decoded_buffer[len++];
//		uint16_decode(p_tsc->hard_accelaration_level);	
//		len += uint16_encode(p_tsc->small_accident_level_x, &p_encoded_buffer[len]);
//		len += uint16_encode(p_tsc->small_accident_level_y, &p_encoded_buffer[len]);
//		len += uint16_encode(p_tsc->medium_accident_level, &p_encoded_buffer[len]);
//		len += uint16_encode(p_tsc->high_accident_level, &p_encoded_buffer[len]);
//		len += uint16_encode(p_tsc->hard_accelaration_level, &p_encoded_buffer[len]);
//		len += uint16_encode(p_tsc->hard_braking_level, &p_encoded_buffer[len]);
//		len += uint16_encode(p_tsc->hard_steering_level_left, &p_encoded_buffer[len]);
//		len += uint16_encode(p_tsc->hard_steering_level_right, &p_encoded_buffer[len]);
//}

/**@brief Function for adding the Characteristic.
 *
 * @param[in]   uuid           UUID of characteristic to be added.
 * @param[in]   p_char_value   Initial value of characteristic to be added.
 * @param[in]   char_len       Length of initial value. This will also be the maximum value.
 * @param[in]   dis_attr_md    Security settings of characteristic to be added.
 * @param[out]  p_handles      Handles of new characteristic.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t pbs_char_add(const ble_gatts_char_md_t  char_md,
													ble_uuid_t                  char_uuid,
                         uint8_t                       * p_char_value,
                         uint16_t                        char_len,
                         const ble_srv_security_mode_t * pbs_attr_md,
                         ble_gatts_char_handles_t      * p_handles)
{
		char_uuid.type = BLE_UUID_TYPE_VENDOR_BEGIN;
	
    
    ble_gatts_attr_t    attr_char_value;
    ble_gatts_attr_md_t attr_md;
		
	
    APP_ERROR_CHECK_BOOL(p_char_value != NULL);
    APP_ERROR_CHECK_BOOL(char_len > 0);

    

    memset(&attr_md, 0, sizeof(attr_md));

    attr_md.read_perm  = pbs_attr_md->read_perm;
    attr_md.write_perm = pbs_attr_md->write_perm;
    attr_md.vloc       = BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth    = 0;
    attr_md.wr_auth    = 0;
    attr_md.vlen       = 0;

    memset(&attr_char_value, 0, sizeof(attr_char_value));

    attr_char_value.p_uuid    = &char_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = char_len;
    attr_char_value.init_offs = 0;
    attr_char_value.max_len   = char_len;
    attr_char_value.p_value   = p_char_value;

    return sd_ble_gatts_characteristic_add(service_handle, &char_md, &attr_char_value, p_handles);
}

// Event Handle 
static void on_connect(ble_pbs_t * p_pbs, ble_evt_t * p_ble_evt)
{
    p_pbs->conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
}

static void on_disconnect(ble_pbs_t * p_pbs, ble_evt_t * p_ble_evt)
{
	UNUSED_PARAMETER(p_ble_evt);
	p_pbs->conn_handle = BLE_CONN_HANDLE_INVALID;
}

uint32_t ble_pbs_drhc_update(ble_pbs_t * p_pbs, uint8_t *drhc_data)
{
    if (p_pbs == NULL)
    {
        return NRF_ERROR_NULL;
    }
    
    uint32_t err_code = NRF_SUCCESS;
    ble_gatts_value_t gatts_value;
		
		// Initialize value struct.
		memset(&gatts_value, 0, sizeof(gatts_value));

		gatts_value.len     = DRHC_ALLDATA_LENGTH;
		gatts_value.offset  = 0;
		gatts_value.p_value = drhc_data;

		// Update database.
		err_code = sd_ble_gatts_value_set(p_pbs->conn_handle,
																			p_pbs->drhc_handles.value_handle,
																			&gatts_value);
#if PBS_DEBUG
		printf("set value err:%04X\r\n",err_code);
#endif
		// Send value if connected and notifying.
		//if ((p_bas->conn_handle != BLE_CONN_HANDLE_INVALID) && p_bas->is_notification_supported)
		if (p_pbs->conn_handle != BLE_CONN_HANDLE_INVALID)
		{
				ble_gatts_hvx_params_t hvx_params;

				memset(&hvx_params, 0, sizeof(hvx_params));

				hvx_params.handle = p_pbs->drhc_handles.value_handle;
				//hvx_params.type   = BLE_GATT_HVX_INDICATION;
				hvx_params.type   =  BLE_GATT_HVX_NOTIFICATION;
				hvx_params.offset = gatts_value.offset;
				hvx_params.p_len  = &gatts_value.len;
				hvx_params.p_data = gatts_value.p_value;

				err_code = sd_ble_gatts_hvx(p_pbs->conn_handle, &hvx_params);
#if PBS_DEBUG
			printf("indicate value err:%04X\r\n",err_code);
#endif
		}
//		if (err_code == NRF_SUCCESS)
//		{
//			start_dw_flag = true;
//			printf("start download\r\n");
//		}
    return err_code;
}
uint32_t ble_pbs_esc_update(ble_pbs_t * p_pbs, uint8_t* esc_data)
{
    if (p_pbs == NULL)
    {
        return NRF_ERROR_NULL;
    }
    
    uint32_t err_code = NRF_SUCCESS;
    ble_gatts_value_t gatts_value;
		
		// Initialize value struct.
		memset(&gatts_value, 0, sizeof(gatts_value));

		gatts_value.len     = ESC_ALLDATA_LENGTH;
		gatts_value.offset  = 0;
		gatts_value.p_value = esc_data;

