gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/ble_pbs/ble_pbs.c
		// Update database.
		err_code = sd_ble_gatts_value_set(p_pbs->conn_handle,
																			p_pbs->esc_handles.value_handle,
																			&gatts_value);
#if PBS_DEBUG
		printf("esc set value err:%04X\r\n",err_code);
#endif
		// Send value if connected and notifying.
		//if ((p_bas->conn_handle != BLE_CONN_HANDLE_INVALID) && p_bas->is_notification_supported)
		if (p_pbs->conn_handle != BLE_CONN_HANDLE_INVALID)
		{
				ble_gatts_hvx_params_t hvx_params;

				memset(&hvx_params, 0, sizeof(hvx_params));

				hvx_params.handle = p_pbs->esc_handles.value_handle;
				hvx_params.type   = BLE_GATT_HVX_INDICATION;
				hvx_params.offset = gatts_value.offset;
				hvx_params.p_len  = &gatts_value.len;
				hvx_params.p_data = gatts_value.p_value;

				err_code = sd_ble_gatts_hvx(p_pbs->conn_handle, &hvx_params);
#if PBS_DEBUG
			printf("esc indicate value err:%04X\r\n",err_code);
#endif
		}
    return err_code;
}
static void on_pbs_cdrc_cccd_write(ble_pbs_t * p_pbs, ble_gatts_evt_write_t * p_evt_write)
{
    if (p_evt_write->len == 2)
    {
        // CCCD written, update notification state
        if (p_pbs->evt_handler != NULL)
        {
            ble_pbs_evt_t evt;

            if (ble_srv_is_notification_enabled(p_evt_write->data))
            {
                evt.evt_type = BLE_PBS_EVT_NOTIFICATION_ENABLED; //evt.evt_type = BLE_PBS_EVT_INDICATION_ENABLED;
            }
            else
            {
                evt.evt_type = BLE_PBS_EVT_NOTIFICATION_DISABLED; //evt.evt_type = BLE_PBS_EVT_INDICATION_DISABLED;
            }

            p_pbs->evt_handler(p_pbs, &evt);
        }
    }
}
// FOR INDICATION
//static void on_hvc(ble_pbs_t * p_pbs, ble_evt_t * p_ble_evt)
//{
//    ble_gatts_evt_hvc_t * p_hvc = &p_ble_evt->evt.gatts_evt.params.hvc;

//    if (p_hvc->handle == p_pbs->cdrc_handles.value_handle)
//    {
//        ble_pbs_evt_t evt;

//        evt.evt_type = BLE_PBS_EVT_INDICATION_CONFIRMED;
//        p_pbs->evt_handler(p_pbs, &evt);
//    }
//}

uint32_t ble_pbs_cdrc_update(ble_pbs_t * p_pbs, uint8_t* cdrc_data)
{
    if (p_pbs == NULL || cdrc_data == NULL)
    {
        return NRF_ERROR_NULL;
    }
    
    uint32_t err_code = NRF_SUCCESS;
    ble_gatts_value_t gatts_value;
		
		// Initialize value struct.
		memset(&gatts_value, 0, sizeof(gatts_value));

		gatts_value.len     = CDRC_ALLDATA_MAX_LENGTH;
		gatts_value.offset  = 0;
		gatts_value.p_value = cdrc_data;

		// Update database.
		err_code = sd_ble_gatts_value_set(p_pbs->conn_handle,
																			p_pbs->cdrc_handles.value_handle,
																			&gatts_value);
#if PBS_DEBUG
		printf("cdrc set value err:%04X\r\n",err_code);
#endif
		// Send value if connected and notifying.
		//if ((p_bas->conn_handle != BLE_CONN_HANDLE_INVALID) && p_bas->is_notification_supported)
		if (p_pbs->conn_handle != BLE_CONN_HANDLE_INVALID)
		{
				ble_gatts_hvx_params_t hvx_params;

				memset(&hvx_params, 0, sizeof(hvx_params));

				hvx_params.handle = p_pbs->cdrc_handles.value_handle;
				//hvx_params.type   = BLE_GATT_HVX_INDICATION;
			hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
				hvx_params.offset = gatts_value.offset;
				hvx_params.p_len  = &gatts_value.len;
				hvx_params.p_data = gatts_value.p_value;

				err_code = sd_ble_gatts_hvx(p_pbs->conn_handle, &hvx_params);
#if PBS_DEBUG
			printf("cdrc indicate value err:%04X\r\n",err_code);
#endif
		}
    return err_code;
}

static void on_write(ble_pbs_t * p_pbs, ble_evt_t * p_ble_evt)
{
		
	// Check if BSC's flag been writen
	uint16_t tempHandle = p_ble_evt->evt.gatts_evt.params.write.handle;
	uint8_t *tempData = p_ble_evt->evt.gatts_evt.params.write.data;
#if PBS_DEBUG				
					printf("handle:%04X\r\n",tempHandle);
					printf("data[0][1]:%02X,%02X\r\n",tempData[0],tempData[1]);
#endif

//uint32_t error_code;

ble_gatts_evt_write_t * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
	if (tempHandle == p_pbs->bsc_handles.value_handle) // write to bsc
	{
		bsc_data_process(tempData, &p_pbs->bsc_s);
	}
	
	// write to esc
//		if (tempHandle == p_pbs->esc_handles.value_handle) 
//		{	
//			printf("write to esc\r\n");
//			// start download event data
//			if (p_evt_write->data[0] == 0x01 && drhc_notify_flag)
//			{
//				//esc_write_flag = true;
//				uint8_t sim_drhc_data[DRHC_ALLDATA_LENGTH] = {20,12,3,1,10,0,0,0,1};
//				ble_pbs_drhc_update(p_pbs,sim_drhc_data);
//			}
//			p_pbs->esc_s.download_control_point = p_evt_write->data[0];
//		}
	
		if(tempHandle == p_pbs->esc_handles.cccd_handle)
    {
				//CCCD been written
        if ( p_evt_write->len == 2)
				{
					esc_notify_flag = !esc_notify_flag;
#if PBS_DEBUG
					printf("esc_notify_flag:%d\r\n",esc_notify_flag);
#endif
				}
		}	
		if ((tempHandle == p_pbs->drhc_handles.cccd_handle) && (p_evt_write->len == 2))
    {
					drhc_notify_flag = !drhc_notify_flag;
#if PBS_DEBUG
					printf("drhc_notify_flag:%d\r\n",drhc_notify_flag);
#endif	
		}	
		if ((tempHandle == p_pbs->cdrc_handles.cccd_handle) && (p_evt_write->len == 2))
    {
					cdrc_notify_flag = !cdrc_notify_flag;
//				uint32_t err_code;
//				uint32_t tempUTC = UTC_get();
//				uint8_t p_tempUTC[4]; 
//				uint32_encode(tempUTC,p_tempUTC);
//				uint8_t sim_drhc_data[9] = {20,12,3,1,9,p_tempUTC[0],p_tempUTC[1],p_tempUTC[2],p_tempUTC[3]};
//				err_code = ble_pbs_drhc_update(p_pbs, sim_drhc_data);
//				printf("drhc_update:%04X\r\n",err_code);
//        on_pbs_cdrc_cccd_write(p_pbs, p_evt_write);
#if PBS_DEBUG
					printf("cdrc_notify_flag:%d\r\n",cdrc_notify_flag);
#endif
		}		
		
}

void ble_pbs_on_ble_evt(ble_pbs_t * p_pbs, ble_evt_t * p_ble_evt)
{
    if (p_pbs == NULL || p_ble_evt == NULL)
    {
        return;
    }
    
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
						printf("pbs_on_ble_Connected\r\n");
            on_connect(p_pbs, p_ble_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
						printf("pbs_on_ble_Disconnected\r\n");
            on_disconnect(p_pbs, p_ble_evt);
            break;

