gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/ble_pbs/ble_pbs.c
        case BLE_GATTS_EVT_WRITE:
            on_write(p_pbs, p_ble_evt);
            break;
				
//				case BLE_GATTS_EVT_HVC:
//					printf("pbs_on_ble_EVT_HVC\r\n");
//            on_hvc(p_pbs, p_ble_evt);
//            break;

        default:
            // No implementation needed.
            break;
    }
}

uint32_t ble_pbs_init(ble_pbs_t * p_pbs)
{
		uint32_t   ser_err_code;
		uint32_t   char_err_code;
		ble_uuid_t service_uuid;
		ble_uuid_t char_uuid_temp;
		ble_uuid_t char_uuid_vendor;
		// Add service
		//BLE_UUID_BLE_ASSIGN(service_uuid, BLE_UUID_PIONEER_BEACON_SERVICE); // For SIG UUID

	// PBS Event Handle
		
	
	// Build GATT Profile 
		uint32_t err_code;
		ble_uuid128_t base_uuid = PBS_UUID_BASE;  // It's invert added from the array sequence, uint8_t [16] array
		//ble_uuid128_t bdc_long_uuid = PBS_BOARDING_DETECTION_REPORT_UUID;
		err_code = sd_ble_uuid_vs_add(&base_uuid, &service_uuid.type); // add to Nordic VS UUID table
		service_uuid.uuid = PBS_SERVICE_SHORT_UUID; // assign short UUID		
		ser_err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &service_uuid, &service_handle);
#if PBS_DEBUG
		//printf("vs_add:%d\r\n",err_code);	
		printf("service_add:%d\r\n",ser_err_code);	
#endif
		//Characteristic Setting
		// The ble_gatts_char_md_t structure uses bit fields. So we reset the memory to zero.
		
		ble_gatts_attr_md_t cccd_md;
		ble_gatts_char_md_t char_md_temp;
		memset(&cccd_md, 0, sizeof(cccd_md));
		memset(&char_md_temp, 0, sizeof(char_md_temp));
		// Configure indicate
		
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
		cccd_md.write_perm = p_pbs->pbs_cccd_md.cccd_write_perm;
		cccd_md.vloc       = BLE_GATTS_VLOC_STACK;
		
		// Characteristic default setting 
    char_md_temp.char_props.read  = 0;
		char_md_temp.char_props.write = 0;
		char_md_temp.char_props.indicate = 0;
		char_md_temp.p_cccd_md        = NULL; //&cccd_md
    char_md_temp.p_char_user_desc = NULL;
    char_md_temp.p_char_pf        = NULL;
    char_md_temp.p_user_desc_md   = NULL;
    char_md_temp.p_sccd_md        = NULL;
	
		//p_pbs->bsc_s.flag = 0x01;  // Can not assign characteristic value here, show read-only variable can not assign
		
		// Threshold Setting Characteristic
		char_uuid_temp.uuid = PBS_THRESHOLD_SETTING_CHAR_SHORT_UUID;
		uint8_t encoded_tsc_data [TSC_ALLDATA_LENGTH];
		tsc_data_encode(encoded_tsc_data, &p_pbs->tsc_s);
		char_md_temp.char_props.read  = 1;
		char_md_temp.char_props.write = 1;
		char_md_temp.char_props.indicate = 0;
		char_md_temp.char_props.notify = 0;
		char_err_code = pbs_char_add(char_md_temp,
														char_uuid_temp,
														encoded_tsc_data,
														TSC_ALLDATA_LENGTH,
														&p_pbs->pbs_attr_md,
														&p_pbs->bsc_handles);
#if PBS_DEBUG
		//printf("tsc_add:%d\r\n",char_err_code);
#endif	
		
		
		// Beacon Setting Characteristic
		char_uuid_temp.uuid = PBS_BEACON_SETTING_CHAR_SHORT_UUID;
		uint8_t encoded_bsc_data [BSC_ALLDATA_LENGTH];
		bsc_data_encode(encoded_bsc_data, &p_pbs->bsc_s);
		char_md_temp.char_props.read  = 1;
		char_md_temp.char_props.write = 1;
		char_md_temp.char_props.indicate = 1;
		char_md_temp.char_props.notify = 0;
		char_err_code = pbs_char_add(char_md_temp,
														char_uuid_temp,
														encoded_bsc_data,
														BSC_ALLDATA_LENGTH,
														&p_pbs->pbs_attr_md,
														&p_pbs->bsc_handles);
#if PBS_DEBUG
		//printf("bsc_add:%d\r\n",char_err_code);
#endif				
												
		// Event Storage Characteristic
		char_uuid_temp.uuid = PBS_EVENT_STORAGE_CHAR_SHORT_UUID;
		uint8_t encoded_esc_data [ESC_ALLDATA_LENGTH];
		esc_data_encode(encoded_esc_data, &p_pbs->esc_s);
		char_md_temp.char_props.read  = 1;
		char_md_temp.char_props.write = 1;
		char_md_temp.char_props.indicate = 1;
		char_md_temp.char_props.notify = 0;
		char_md_temp.p_cccd_md = &cccd_md;
		char_err_code = pbs_char_add(char_md_temp,
														char_uuid_temp,
														encoded_esc_data,
														ESC_ALLDATA_LENGTH,// Can not use sizeof(esc_t), or it will be 4
														&p_pbs->pbs_attr_md,
														&p_pbs->esc_handles);
		// Notify flag
		esc_notify_flag = false;
#if PBS_DEBUG
		//printf("esc_add:%d\r\n",char_err_code);
#endif							
		// Data Report Header Characteristic
		char_uuid_temp.uuid = PBS_DATA_REPORT_HEADER_CHAR_SHORT_UUID;
		uint8_t encoded_drhc_data [DRHC_ALLDATA_LENGTH];
		drhc_data_encode(encoded_drhc_data, &p_pbs->drhc_s);
		char_md_temp.char_props.read  = 1;
		char_md_temp.char_props.write = 0;
		char_md_temp.char_props.indicate = 0;
		char_md_temp.char_props.notify = 1;
		char_md_temp.p_cccd_md = &cccd_md;
		char_err_code = pbs_char_add(char_md_temp,
														char_uuid_temp,
														encoded_drhc_data,
														DRHC_ALLDATA_LENGTH,
														&p_pbs->pbs_attr_md,
														&p_pbs->drhc_handles);
		drhc_notify_flag = false;
#if PBS_DEBUG
		//printf("drhc_add:%d\r\n",char_err_code);												
#endif
		// Cal Data Report Characteristic
		char_uuid_temp.uuid = PBS_CAL_DATA_REPORT_CHAR_SHORT_UUID;
		uint16_t CDRC_ALLDATA_LENGTH = 20;
		uint8_t encoded_cdrc_data [CDRC_ALLDATA_LENGTH];
		cdrc_data_encode(encoded_cdrc_data, &p_pbs->cdrc_s);
		char_md_temp.char_props.read  = 1;
		char_md_temp.char_props.write = 0;
		char_md_temp.char_props.indicate = 0;
		char_md_temp.char_props.notify = 1;
		char_md_temp.p_cccd_md = &cccd_md;
		char_err_code = pbs_char_add(char_md_temp,
														char_uuid_temp,
														encoded_cdrc_data,
														CDRC_ALLDATA_LENGTH,
														&p_pbs->pbs_attr_md,
														&p_pbs->cdrc_handles);
		cdrc_notify_flag = false;
#if PBS_DEBUG
		//printf("cdrc_add:%d\r\n",char_err_code);
#endif
		// Raw Data Report Characteristic
		char_uuid_temp.uuid = PBS_RAW_DATA_REPORT_CHAR_SHORT_UUID;
		uint16_t RDRC_ALLDATA_LENGTH = p_pbs->rdrc_s.data_packet_length+2;
		uint8_t encoded_rdrc_data [RDRC_ALLDATA_LENGTH];
		rdrc_data_encode(encoded_rdrc_data, &p_pbs->rdrc_s);
		char_md_temp.char_props.read  = 1;
		char_md_temp.char_props.write = 0;
		char_md_temp.char_props.indicate = 1;
		char_md_temp.char_props.notify = 0;
		char_md_temp.p_cccd_md = &cccd_md;
		char_err_code = pbs_char_add(char_md_temp,
														char_uuid_temp,
														encoded_rdrc_data,
														RDRC_ALLDATA_LENGTH,
														&p_pbs->pbs_attr_md,
														&p_pbs->rdrc_handles);
		rdrc_notify_flag = false;
#if PBS_DEBUG
		//printf("rdrc_add:%d\r\n",char_err_code);
#endif				
		ble_uuid_t venCharID;
// Boarding Detection Report Characteristic
		//ble_uuid128_t bdc_long_uuid = PBS_BOARDING_DETECTION_REPORT_UUID;  // It's invert added from the array sequence, uint8_t [16] array
		//err_code = sd_ble_uuid_vs_add(&bdc_long_uuid, &venCharID.type); // add to Nordic VS UUID table
		//printf("bdc_long_uuid_vs_add:%04X\r\n",err_code);
		char_uuid_temp.uuid = 0x9F55;
		uint8_t encoded_bdc_data [BDC_ALLDATA_LENGTH];
		bdc_data_encode(encoded_bdc_data, &p_pbs->bdc_s);
		char_md_temp.char_props.read  = 1;
		char_md_temp.char_props.write = 1;
		char_md_temp.char_props.indicate = 0;
		char_md_temp.char_props.notify = 0;
		char_md_temp.p_cccd_md = &cccd_md;
		char_err_code = pbs_char_add(char_md_temp,
														char_uuid_temp,
														encoded_bdc_data,
														BDC_ALLDATA_LENGTH,
														&p_pbs->pbs_attr_md,
														&p_pbs->bdc_handles);
#if PBS_DEBUG
		printf("bdc_add:%d\r\n",char_err_code);
#endif						
// Button Data Report Characteristic
		ble_uuid128_t bdrc_long_uuid = PBS_BUTTON_DATA_REPORT_UUID;  // It's invert added from the array sequence, uint8_t [16] array
		err_code = sd_ble_uuid_vs_add(&bdrc_long_uuid, &char_uuid_vendor.type); // add to Nordic VS UUID table
		printf("bdrc_long_uuid_vs_add:%04X\r\n",err_code);
		char_uuid_vendor.uuid = 0xE409;
		uint8_t encoded_bdrc_data [BDRC_ALLDATA_LENGTH];
		bdrc_data_encode(encoded_bdrc_data, &p_pbs->bdrc_s);
		char_md_temp.char_props.read  = 1;
		char_md_temp.char_props.write = 1;
		char_md_temp.char_props.indicate = 1;
		char_md_temp.char_props.notify = 0;
		char_md_temp.p_cccd_md = &cccd_md;
		char_err_code = pbs_char_add(char_md_temp,
														char_uuid_vendor,
														encoded_bdrc_data,
														BDRC_ALLDATA_LENGTH,
														&p_pbs->pbs_attr_md,
														&p_pbs->bdrc_handles);
#if PBS_DEBUG
		printf("bdrc_add:%d\r\n",char_err_code);
#endif		
	return NRF_SUCCESS;
}

